-- print('ruRU') - Translator ZamestoTV
local L = LibStub("AceLocale-3.0"):NewLocale("DragonflightUI", "ruRU", true)

-- modules - config.lua
L["ModuleTooltipActionbar"] =
    "Этот аддон изменяет стандартную панель действий, включая кнопки «Микроменю» и «Сумка».\nДобавляет отдельные параметры для панели действий 1-8, Петов-/XP-/Реп.-/Possess-/Позиция-/Тотембар, Сумки и микроменю."
L["ModuleTooltipBossframe"] = "Этот модуль добавляет пользовательские фреймы босса.\nРАБОТА В ПРОЦЕССЕ."
L["ModuleTooltipBuffs"] = "Этот модуль изменяет фрейм баффов по умолчанию.\nДобавляет отдельные параметры для баффов и дебаффов."
L["ModuleTooltipCastbar"] =
    "Этот модуль изменяет панель кастов по умолчанию.\nДобавляет отдельные параметры для Игрока-, Фокуса- и TargetCastbar."
L["ModuleTooltipChat"] = "Этот модуль изменяет окно чата по умолчанию.\nРАБОТА В ПРОЦЕССЕ."
L["ModuleTooltipDarkmode"] =
    "Этот модуль добавляет темный режим к нескольким фреймам DragonflightUI.\nРАБОТА В ПРОЦЕССЕ - пожалуйста, оставьте отзыв!"
L["ModuleTooltipMinimap"] =
    "Этот модуль модернизирует стандартную миникарту и квесттрекер.\nДобавляет отдельные опции для миникарты и квесттрекера."
L["ModuleTooltipUI"] =
    "Этот модуль добавляет современный стиль пользовательского интерфейса в различные окна, такие как окно персонажа. Также добавляет специфичные для Era переделки с новой книгой заклинаний, окном талантов или окном профессии."
L["ModuleTooltipUnitframe"] =
    "Этот модуль перерабатывает стандартные юнитфреймы и добавляет новые функции, такие как цвет класса или здоровье монстра (Era).\nДобавляет отдельные опции для Игрока-, Пета-, Цели-, Фокуса-, и PartyUnitframes."
L["ModuleTooltipUtility"] = "Этот модуль добавляет общие функции и настройки пользовательского интерфейса.\nРАБОТА В ПРОЦЕССЕ"

-- profiles
L["ProfilesSetActiveProfile"] = "Установить активный профиль."
L["ProfilesNewProfile"] = "Создать новый профиль."
L["ProfilesCopyFrom"] = "Скопируйте настройки из одного существующего профиля в текущий активный профиль."
L["ProfilesOpenCopyDialogue"] = "Открывает диалог копирования."
L["ProfilesDeleteProfile"] = "Удалить существующий профиль из базы данных."
L["ProfilesOpenDeleteDialogue"] = "Открывает диалог удаления."

L["ProfilesChatNewProfile"] = "новый профиль: "
L["ProfilesErrorNewProfile"] = "ОШИБКА: Имя нового профиля не может быть пустым!"

L["ProfilesDialogueDeleteProfile"] = "Удалить профиль \'%s\'?"
L["ProfilesDialogueCopyProfile"] = "Копировать профиль \'%s\'?"
